ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/Forms/СведенияОбОборудовании/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Лаборатория = Параметры.Лаборатория;
	Оборудование = Параметры.Оборудование;
	РегистрационныйНомер = Параметры.РегистрационныйНомер;
	ИнвентарныйНомер = Параметры.ИнвентарныйНомер;
	ЗаводскойНомер = Параметры.ЗаводскойНомер;
	ЗаводскоеОбозначение = Параметры.ЗаводскоеОбозначение;
	НомерПаспортаНаОборудование = Параметры.НомерПаспортаНаОборудование;
	ДатаИзготовления = Параметры.ДатаИзготовления;
	ДатаВводаВЭксплуатацию = Параметры.ДатаВводаВЭксплуатацию;
	СрокДопустимойЭксплуатации = Параметры.СрокДопустимойЭксплуатации;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.Период КАК ДатаПериодическойАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ДатаСледующейПоверки КАК СрокПоследующейАттестации,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.НомерСвидетельстваОПоверке,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.ПроверяющаяОрганизация,
	|	лис_ПоверкиЛабораторногоОборудованияСрезПоследних.СрокДействияСвидетельстваОПоверке
	|ИЗ
	|	РегистрСведений.лис_ПоверкиЛабораторногоОборудования.СрезПоследних(
	|			&Дата,
	|			ЛабораторноеОборудование = &ЛабораторноеОборудование
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И РегистрационныйНомер = &РегистрационныйНомер
	|				И ЗаводскойНомер = &ЗаводскойНомер) КАК лис_ПоверкиЛабораторногоОборудованияСрезПоследних";
	Запрос.УстановитьПараметр("ЛабораторноеОборудование", Параметры.Оборудование);
	Запрос.УстановитьПараметр("РегистрационныйНомер", Параметры.РегистрационныйНомер);
	Запрос.УстановитьПараметр("ЗаводскойНомер", Параметры.ЗаводскойНомер);
	Запрос.УстановитьПараметр("ИнвентарныйНомер", Параметры.ИнвентарныйНомер);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НомерСвидетельстваОПоверке = Выборка.НомерСвидетельстваОПоверке;
		ДатаПоследнейПоверки = Выборка.ДатаПериодическойАттестации;
		ДатаПоследующейПоверки = Выборка.СрокПоследующейАттестации;
		ПроверяющаяОрганизация = Выборка.ПроверяющаяОрганизация;
		СрокДействияСвидетельстваОПоверке = Выборка.СрокДействияСвидетельстваОПоверке;
	КонецЕсли;	
	
КонецПроцедуры
